alert('سلام ، خوش آمدی ، ی چند تا سوال شخصی ازت میپرسیم لطفا پاسخ بده 😊');

let userName = prompt('اسمت چیست ؟');

alert('Hello ' + userName);

let userAge = prompt('چند سالته ؟');

alert('your age is : ' + userAge);

let isMarrid = confirm('آیا تو متاهلی ؟');

alert(isMarrid);

let dateOfBirth = prompt('متولد چه سالی هستی ؟');

alert('تو متولد : ' + dateOfBirth + 'هستی');

let phoneNumber = prompt('لطفا شماره تلفن خود را وارد کنید');

alert('شماره تلفن شما ثبت شد : ' + phoneNumber);

let codeMeli = prompt('لطفا کد ملی خود را وارد کنید');

alert('کد ملی شما ثبت شد : ' + codeMeli);

let bloodGrop = prompt('تو چه گروه خونی ای هستی ؟');

alert('گروه خونی شما : ' + bloodGrop + ' : ' + 'ثبت شد ');

let degree = prompt('مدرک تحصیلی شما چیست ؟');

alert('مدرک تحصیلی شما : ' + degree + ' : ' + 'ثبت شد');

let endOfServiceCard = confirm('آیا کارت پایان خدمت داری ؟');

alert(endOfServiceCard);

let residence = prompt('شهر محل سکونت خود را بنویسید');

alert('محل سکونت شما : ' + residence + ' : ' + ' ثبت شد ');

alert('خیلی ازتون ممنونم که به سوال های شخصی ای که ازتون پرسیدیم پاسخ دادید ، تا درودی دیگر بدرود 👋');